littlekernel/lk/platform/stm32f1xx/vectab.c
#ifdef STM32F10X_XL
    VECTAB_ENTRY(ADC1_2_IRQ),                /*!< ADC1 and ADC2 global Interrupt                       */
    VECTAB_ENTRY(USB_HP_CAN1_TX_IRQ),        /*!< USB Device High Priority or CAN1 TX Interrupts       */
    VECTAB_ENTRY(USB_LP_CAN1_RX0_IRQ),       /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
    VECTAB_ENTRY(CAN1_RX1_IRQ),              /*!< CAN1 RX1 Interrupt                                   */
    VECTAB_ENTRY(CAN1_SCE_IRQ),              /*!< CAN1 SCE Interrupt                                   */
    VECTAB_ENTRY(EXTI9_5_IRQ),               /*!< External Line[9:5] Interrupts                        */
    VECTAB_ENTRY(TIM1_BRK_TIM9_IRQ),         /*!< TIM1 Break Interrupt and TIM9 global Interrupt       */
    VECTAB_ENTRY(TIM1_UP_TIM10_IRQ),         /*!< TIM1 Update Interrupt and TIM10 global Interrupt     */
    VECTAB_ENTRY(TIM1_TRG_COM_TIM11_IRQ),    /*!< TIM1 Trigger and Commutation Interrupt and TIM11 global interrupt */
    VECTAB_ENTRY(TIM1_CC_IRQ),               /*!< TIM1 Capture Compare Interrupt                       */
    VECTAB_ENTRY(TIM2_IRQ),                  /*!< TIM2 global Interrupt                                */
    VECTAB_ENTRY(TIM3_IRQ),                  /*!< TIM3 global Interrupt                                */
    VECTAB_ENTRY(TIM4_IRQ),                  /*!< TIM4 global Interrupt                                */
    VECTAB_ENTRY(I2C1_EV_IRQ),               /*!< I2C1 Event Interrupt                                 */
    VECTAB_ENTRY(I2C1_ER_IRQ),               /*!< I2C1 Error Interrupt                                 */
    VECTAB_ENTRY(I2C2_EV_IRQ),               /*!< I2C2 Event Interrupt                                 */
    VECTAB_ENTRY(I2C2_ER_IRQ),               /*!< I2C2 Error Interrupt                                 */
    VECTAB_ENTRY(SPI1_IRQ),                  /*!< SPI1 global Interrupt                                */
    VECTAB_ENTRY(SPI2_IRQ),                  /*!< SPI2 global Interrupt                                */
    VECTAB_ENTRY(USART1_IRQ),                /*!< USART1 global Interrupt                              */
    VECTAB_ENTRY(USART2_IRQ),                /*!< USART2 global Interrupt                              */
    VECTAB_ENTRY(USART3_IRQ),                /*!< USART3 global Interrupt                              */
    VECTAB_ENTRY(EXTI15_10_IRQ),             /*!< External Line[15:10] Interrupts                      */
    VECTAB_ENTRY(RTCAlarm_IRQ),              /*!< RTC Alarm through EXTI Line Interrupt                */
    VECTAB_ENTRY(USBWakeUp_IRQ),             /*!< USB Device WakeUp from suspend through EXTI Line Interrupt */
    VECTAB_ENTRY(TIM8_BRK_TIM12_IRQ),        /*!< TIM8 Break Interrupt and TIM12 global Interrupt      */
    VECTAB_ENTRY(TIM8_UP_TIM13_IRQ),         /*!< TIM8 Update Interrupt and TIM13 global Interrupt     */
    VECTAB_ENTRY(TIM8_TRG_COM_TIM14_IRQ),    /*!< TIM8 Trigger and Commutation Interrupt and TIM14 global interrupt */
    VECTAB_ENTRY(TIM8_CC_IRQ),               /*!< TIM8 Capture Compare Interrupt                       */
    VECTAB_ENTRY(ADC3_IRQ),                  /*!< ADC3 global Interrupt                                */
    VECTAB_ENTRY(FSMC_IRQ),                  /*!< FSMC global Interrupt                                */
    VECTAB_ENTRY(SDIO_IRQ),                  /*!< SDIO global Interrupt                                */
    VECTAB_ENTRY(TIM5_IRQ),                  /*!< TIM5 global Interrupt                                */
    VECTAB_ENTRY(SPI3_IRQ),                  /*!< SPI3 global Interrupt                                */
    VECTAB_ENTRY(UART4_IRQ),                 /*!< UART4 global Interrupt                               */
    VECTAB_ENTRY(UART5_IRQ),                 /*!< UART5 global Interrupt                               */
    VECTAB_ENTRY(TIM6_IRQ),                  /*!< TIM6 global Interrupt                                */
    VECTAB_ENTRY(TIM7_IRQ),                  /*!< TIM7 global Interrupt                                */
    VECTAB_ENTRY(DMA2_Channel1_IRQ),         /*!< DMA2 Channel 1 global Interrupt                      */
    VECTAB_ENTRY(DMA2_Channel2_IRQ),         /*!< DMA2 Channel 2 global Interrupt                      */
    VECTAB_ENTRY(DMA2_Channel3_IRQ),         /*!< DMA2 Channel 3 global Interrupt                      */
    VECTAB_ENTRY(DMA2_Channel4_5_IRQ),       /*!< DMA2 Channel 4 and Channel 5 global Interrupt        */
#endif /* STM32F10X_XL */

#ifdef STM32F10X_CL
    VECTAB_ENTRY(ADC1_2_IRQ),                /*!< ADC1 and ADC2 global Interrupt                       */
    VECTAB_ENTRY(CAN1_TX_IRQ),               /*!< USB Device High Priority or CAN1 TX Interrupts       */
    VECTAB_ENTRY(CAN1_RX0_IRQ),              /*!< USB Device Low Priority or CAN1 RX0 Interrupts       */
    VECTAB_ENTRY(CAN1_RX1_IRQ),              /*!< CAN1 RX1 Interrupt                                   */
    VECTAB_ENTRY(CAN1_SCE_IRQ),              /*!< CAN1 SCE Interrupt                                   */
    VECTAB_ENTRY(EXTI9_5_IRQ),               /*!< External Line[9:5] Interrupts                        */
    VECTAB_ENTRY(TIM1_BRK_IRQ),              /*!< TIM1 Break Interrupt                                 */
    VECTAB_ENTRY(TIM1_UP_IRQ),               /*!< TIM1 Update Interrupt                                */
    VECTAB_ENTRY(TIM1_TRG_COM_IRQ),          /*!< TIM1 Trigger and Commutation Interrupt               */
    VECTAB_ENTRY(TIM1_CC_IRQ),               /*!< TIM1 Capture Compare Interrupt                       */
    VECTAB_ENTRY(TIM2_IRQ),                  /*!< TIM2 global Interrupt                                */
    VECTAB_ENTRY(TIM3_IRQ),                  /*!< TIM3 global Interrupt                                */
    VECTAB_ENTRY(TIM4_IRQ),                  /*!< TIM4 global Interrupt                                */
    VECTAB_ENTRY(I2C1_EV_IRQ),               /*!< I2C1 Event Interrupt                                 */
    VECTAB_ENTRY(I2C1_ER_IRQ),               /*!< I2C1 Error Interrupt                                 */
    VECTAB_ENTRY(I2C2_EV_IRQ),               /*!< I2C2 Event Interrupt                                 */
    VECTAB_ENTRY(I2C2_ER_IRQ),               /*!< I2C2 Error Interrupt                                 */
    VECTAB_ENTRY(SPI1_IRQ),                  /*!< SPI1 global Interrupt                                */
    VECTAB_ENTRY(SPI2_IRQ),                  /*!< SPI2 global Interrupt                                */
    VECTAB_ENTRY(USART1_IRQ),                /*!< USART1 global Interrupt                              */
    VECTAB_ENTRY(USART2_IRQ),                /*!< USART2 global Interrupt                              */
    VECTAB_ENTRY(USART3_IRQ),                /*!< USART3 global Interrupt                              */
    VECTAB_ENTRY(EXTI15_10_IRQ),             /*!< External Line[15:10] Interrupts                      */
    VECTAB_ENTRY(RTCAlarm_IRQ),              /*!< RTC Alarm through EXTI Line Interrupt                */
    VECTAB_ENTRY(OTG_FS_WKUP_IRQ),           /*!< USB OTG FS WakeUp from suspend through EXTI Line Interrupt */
    VECTAB_ENTRY(TIM5_IRQ),                  /*!< TIM5 global Interrupt                                */
    VECTAB_ENTRY(SPI3_IRQ),                  /*!< SPI3 global Interrupt                                */
    VECTAB_ENTRY(UART4_IRQ),                 /*!< UART4 global Interrupt                               */
    VECTAB_ENTRY(UART5_IRQ),                 /*!< UART5 global Interrupt                               */
    VECTAB_ENTRY(TIM6_IRQ),                  /*!< TIM6 global Interrupt                                */
    VECTAB_ENTRY(TIM7_IRQ),                  /*!< TIM7 global Interrupt                                */
    VECTAB_ENTRY(DMA2_Channel1_IRQ),         /*!< DMA2 Channel 1 global Interrupt                      */
    VECTAB_ENTRY(DMA2_Channel2_IRQ),         /*!< DMA2 Channel 2 global Interrupt                      */
    VECTAB_ENTRY(DMA2_Channel3_IRQ),         /*!< DMA2 Channel 3 global Interrupt                      */
    VECTAB_ENTRY(DMA2_Channel4_IRQ),         /*!< DMA2 Channel 4 global Interrupt                      */
    VECTAB_ENTRY(DMA2_Channel5_IRQ),         /*!< DMA2 Channel 5 global Interrupt                      */
    VECTAB_ENTRY(ETH_IRQ),                   /*!< Ethernet global Interrupt                            */
    VECTAB_ENTRY(ETH_WKUP_IRQ),              /*!< Ethernet Wakeup through EXTI line Interrupt          */
    VECTAB_ENTRY(CAN2_TX_IRQ),               /*!< CAN2 TX Interrupt                                    */
    VECTAB_ENTRY(CAN2_RX0_IRQ),              /*!< CAN2 RX0 Interrupt                                   */
    VECTAB_ENTRY(CAN2_RX1_IRQ),              /*!< CAN2 RX1 Interrupt                                   */
    VECTAB_ENTRY(CAN2_SCE_IRQ),              /*!< CAN2 SCE Interrupt                                   */
    VECTAB_ENTRY(OTG_FS_IRQ),                /*!< USB OTG FS global Interrupt                          */
#endif /* STM32F10X_CL */
};

